{
    "id": "Dataset_B",
    "dataset_description": {
      "simplified": "A dataset with multiple nodes and branching pathways that converge into three different sinks.",
      "detailed": "This dataset contains requirements that diverge into different pathways. It tests the model's capability to manage branching logic, ensuring it can handle moderately complex logical flows and merge paths correctly when it is intended."
    },
    "complexity_level": "Intermediate",
    "requirements": [
      {
        "id": "REQ_101A",
        "given": "The system requires CTRL1 and CTRL2 signals for monitoring critical operational parameters.",
        "when": "CTRL1 is triggered when the temperature exceeds the predefined safety threshold; CTRL2 is activated when the brake usage reaches its maximum allowable count within a specified period.",
        "then": "These signals provide input for further processing and decision-making within the system.",
        "requires": "CTRL1 (temperature monitoring), CTRL2 (brake usage monitoring)",
        "provides": "",
        "embeds": "",
        "derived_from": "",
        "description": "ID: REQ_101A contents: The system requires CTRL1 and CTRL2 signals for monitoring critical operational parameters. GIVEN: The system requires CTRL1 and CTRL2 signals for monitoring critical operational parameters. WHEN: CTRL1 is triggered when the temperature exceeds the predefined safety threshold; CTRL2 is activated when the brake usage reaches its maximum allowable count within a specified period. THEN: These signals provide input for further processing and decision-making within the system. REQUIRES: CTRL1 (temperature monitoring), CTRL2 (brake usage monitoring) PROVIDES: EMBEDS: DERIVED_FROM: ",
        "natural_language_requirement": "The system monitors CTRL1 and CTRL2 signals to ensure that temperature and brake usage levels remain within safety limits. CTRL1 monitors temperature thresholds, while CTRL2 tracks brake usage frequency within a specified period. These inputs are critical for system actions."
      },
      {
        "id": "REQ_101B",
        "given": "The system requires signals CTRL3, CTRL4, and CTRL5 for monitoring additional safety parameters.",
        "when": "CTRL3 detects abnormal pressure levels; CTRL4 monitors the integrity of the braking system; CTRL5 identifies potential track obstructions.",
        "then": "These signals provide input to engage the LED warning system (LED2) and the braking mechanism (ACT2) when necessary.",
        "requires": "CTRL3 (pressure monitoring), CTRL4 (braking system integrity), CTRL5 (track obstruction monitoring)",
        "provides": "",
        "embeds": "",
        "derived_from": "",
        "description": "ID: REQ_101B contents: The system requires signals CTRL3, CTRL4, and CTRL5 for monitoring additional safety parameters. GIVEN: The system requires signals CTRL3, CTRL4, and CTRL5 for monitoring additional safety parameters. WHEN: CTRL3 detects abnormal pressure levels; CTRL4 monitors the integrity of the braking system; CTRL5 identifies potential track obstructions. THEN: These signals provide input to engage the LED warning system (LED2) and the braking mechanism (ACT2) when necessary. REQUIRES: CTRL3 (pressure monitoring), CTRL4 (braking system integrity), CTRL5 (track obstruction monitoring) PROVIDES: EMBEDS: DERIVED_FROM: ",
        "natural_language_requirement": "The system monitors CTRL3 for pressure anomalies, CTRL4 for brake integrity issues, and CTRL5 for track obstacles. These signals are used to activate LED2 and the braking mechanism ACT2 when necessary to ensure train safety."
      },
      {
        "id": "REQ_102",
        "given": "The system requires activators ACT1 and ACT2 for controlling cooling and braking systems.",
        "when": "ACT1 is used to activate the cooling system when temperature thresholds are exceeded; ACT2 is used to activate the braking mechanism based on sensor inputs.",
        "then": "These activators engage the respective cooling and braking actions when signaled by the system.",
        "requires": "ACT1 (cooling system activation), ACT2 (braking mechanism activation)",
        "provides": "Cooling action, Braking action",
        "embeds": "",
        "derived_from": "REQ_101A, REQ_101B",
        "description": "ID: REQ_102 contents: The system requires activators ACT1 and ACT2 for controlling cooling and braking systems. GIVEN: The system requires activators ACT1 and ACT2 for controlling cooling and braking systems. WHEN: ACT1 is used to activate the cooling system when temperature thresholds are exceeded; ACT2 is used to activate the braking mechanism based on sensor inputs. THEN: These activators engage the respective cooling and braking actions when signaled by the system. REQUIRES: ACT1 (cooling system activation), ACT2 (braking mechanism activation) PROVIDES: Cooling action, Braking action EMBEDS: DERIVED_FROM: REQ_101A, REQ_101B",
        "natural_language_requirement": "The system uses activators ACT1 and ACT2 to control temperature and braking systems. ACT1 cools the system when needed, while ACT2 activates braking based on various sensor inputs, ensuring operational safety."
      },
      {
        "id": "REQ_111",
        "given": "Either signal CTRL1 or CTRL2 is detected by the train's onboard diagnostic system.",
        "when": "The train is in motion and the diagnostic system is active.",
        "then": "The system shall activate LED1 and engage the cooling mechanism ACT1 to prevent overheating.",
        "requires": "CTRL1, CTRL2",
        "provides": "LED1, ACT1",
        "embeds": "",
        "derived_from": "REQ_101A, REQ_102",
        "description": "ID: REQ_111 contents: Either signal CTRL1 or CTRL2 is detected by the train's onboard diagnostic system. WHEN: The train is in motion and the diagnostic system is active. THEN: The system shall activate LED1 and engage the cooling mechanism ACT1 to prevent overheating. REQUIRES: CTRL1, CTRL2 PROVIDES: LED1, ACT1 EMBEDS: DERIVED_FROM: REQ_101A, REQ_102",
        "natural_language_requirement": "When the train is moving, and either CTRL1 or CTRL2 is detected by the onboard system, LED1 is activated, and the cooling mechanism ACT1 is engaged to prevent overheating."
      },
      {
        "id": "REQ_112",
        "given": "Sensor readings from CTRL3, CTRL4, and CTRL5 exceed their respective safety thresholds (integer readings are greater or equal than 6).",
        "when": "The train is in motion, and the safety monitoring system is active.",
        "then": "The system shall activate LED2 and engage the braking mechanism ACT2.",
        "requires": "CTRL3, CTRL4, CTRL5",
        "provides": "LED2, ACT2",
        "embeds": "",
        "derived_from": "REQ_101B, REQ_102",
        "description": "ID: REQ_112 contents: Sensor readings from CTRL3, CTRL4, and CTRL5 exceed their respective safety thresholds (integer readings are greater or equal than 6). WHEN: The train is in motion, and the safety monitoring system is active. THEN: The system shall activate LED2 and engage the braking mechanism ACT2. REQUIRES: CTRL3, CTRL4, CTRL5 PROVIDES: LED2, ACT2 EMBEDS: DERIVED_FROM: REQ_101B, REQ_102",
        "natural_language_requirement": "If readings from CTRL3, CTRL4, and CTRL5 exceed or are equal to 6 while the train is moving, the system activates LED2 and engages the braking mechanism ACT2."
      },
      {
        "id": "REQ_113",
        "given": "Both mechanisms ACT1 and ACT2 are active.",
        "when": "The train is in motion, and the safety monitoring system is active.",
        "then": "The system shall initiate an emergency brake (BRK1) to bring the train to a halt.",
        "requires": "ACT1, ACT2",
        "provides": "BRK1",
        "embeds": "",
        "derived_from": "REQ_111, REQ_112, REQ_102",
        "description": "ID: REQ_113 contents: Both mechanisms ACT1 and ACT2 are active. WHEN: The train is in motion, and the safety monitoring system is active. THEN: The system shall initiate an emergency brake (BRK1) to bring the train to a halt. REQUIRES: ACT1, ACT2 PROVIDES: BRK1 EMBEDS: DERIVED_FROM: REQ_111, REQ_112, REQ_102",
        "natural_language_requirement": "If both cooling and braking mechanisms (ACT1 and ACT2) are active while the train is in motion, the system will engage the emergency brake (BRK1) to halt the train."
      },
      {
        "id": "REQ_114",
        "given": "The train's speed exceeds 120 km/h.",
        "when": "The train is in motion, and the speed monitoring system is active.",
        "then": "The system shall activate the speed warning light (LED3) and engage a speed reduction mechanism (ACT3).",
        "requires": "Speed Sensor",
        "provides": "LED3, ACT3",
        "embeds": "",
        "derived_from": "REQ_101A",
        "description": "ID: REQ_114 contents: The train's speed exceeds 120 km/h. WHEN: The train is in motion, and the speed monitoring system is active. THEN: The system shall activate the speed warning light (LED3) and engage a speed reduction mechanism (ACT3). REQUIRES: Speed Sensor PROVIDES: LED3, ACT3 EMBEDS: DERIVED_FROM: REQ_101A",
        "natural_language_requirement": "If the train's speed exceeds 120 km/h, the speed monitoring system activates LED3 and engages ACT3 to reduce the speed."
      },
      {
        "id": "REQ_115",
        "given": "The train's tilt sensor detects an incline lesser than 5 degrees.",
        "when": "The train is in motion, and the incline monitoring system is active.",
        "then": "The system shall activate the tilt warning light (LED4) and adjust the suspension system (ACT4) to stabilize the train.",
        "requires": "Tilt Sensor",
        "provides": "LED4, ACT4",
        "embeds": "",
        "derived_from": "REQ_101A",
        "description": "ID: REQ_115 contents: The train's tilt sensor detects an incline lesser than 5 degrees. WHEN: The train is in motion, and the incline monitoring system is active. THEN: The system shall activate the tilt warning light (LED4) and adjust the suspension system (ACT4) to stabilize the train. REQUIRES: Tilt Sensor PROVIDES: LED4, ACT4 EMBEDS: DERIVED_FROM: REQ_101A",
        "natural_language_requirement": "If the incline is lesser than 5 degrees while the train is in motion, the incline monitoring system activates LED4 and engages ACT4 to stabilize the train."
      }
    ],
    "plc_xml_code_url": "https://github.com/NicolasRestrepoTorres/fbd_dataset/plc_xml_code.xml",
    "plc_xml_code_relative_path": "datasets/dataset_B/plc_xml_code.xml",
    "plantuml_diagram_url": "https://github.com/NicolasRestrepoTorres/fbd_dataset/plantuml_diagram.puml",
    "plantuml_diagram_relative_path": "datasets/dataset_B/plantuml_diagram.puml"
}

